#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_availability_zones.available: Reading...
aws_service_discovery_http_namespace.namespace: Refreshing state... [id=ns-d27rejx4couw5als]
data.aws_caller_identity.current: Reading...
aws_kms_key.custom_kms_key: Refreshing state... [id=bb68b1d6-c32e-4451-806a-921461e4e9fb]
aws_vpc.this: Refreshing state... [id=vpc-0a4672ac46effdfa1]
aws_route_table.this_rt_private: Refreshing state... [id=rtb-0628cf5bfda25f054]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
aws_cloudwatch_log_group.logs: Refreshing state... [id=/amazon-ecs/app-weather/log]
aws_cloudwatch_log_group.service_connect_logs: Refreshing state... [id=/amazon-ecs/app-weather/service-connect]
aws_kms_key_policy.encrypt_app: Refreshing state... [id=bb68b1d6-c32e-4451-806a-921461e4e9fb]
aws_ecr_repository.api_container: Refreshing state... [id=app-weather-api]
aws_kms_alias.key: Refreshing state... [id=alias/app-weather]
aws_ecr_repository.web_container: Refreshing state... [id=app-weather-web]
aws_secretsmanager_secret.ecs_secret: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:743794601996:secret:ecs_secret_app-weather-EXHwy4]
aws_secretsmanager_secret_version.ecs_secret_version: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:743794601996:secret:ecs_secret_app-weather-EXHwy4|terraform-20241214174209074600000003]
aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:us-east-2:743794601996:cluster/app-weather]
aws_subnet.public[1]: Refreshing state... [id=subnet-08ee0b91a5f9d6900]
aws_security_group.container_sg: Refreshing state... [id=sg-0da63b35d4eabecee]
aws_default_security_group.default: Refreshing state... [id=sg-041395efa4445e9f5]
aws_internet_gateway.this_igw: Refreshing state... [id=igw-0be1c340918133b77]
aws_security_group.custom_sg: Refreshing state... [id=sg-0211a272c0b41a2fd]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-weather/67c536ad15161de8]
aws_subnet.public[0]: Refreshing state... [id=subnet-0830e0ca62080c581]
aws_route_table.this_rt: Refreshing state... [id=rtb-02bbf5901ddb3f50e]
aws_subnet.private[1]: Refreshing state... [id=subnet-0d4a6bb23a2bdedfd]
aws_vpc_endpoint.s3: Refreshing state... [id=vpce-04766720d62b46561]
aws_subnet.private[0]: Refreshing state... [id=subnet-097abde68839a78a7]
aws_security_group.endpoint_sg: Refreshing state... [id=sg-0f908ca23a7508b36]
aws_security_group_rule.egress_load_balancer: Refreshing state... [id=sgrule-3636111681]
aws_security_group_rule.ingress_load_balancer: Refreshing state... [id=sgrule-2321667585]
aws_lb.app_lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:loadbalancer/app/app-weather/c2ecf69bbae2469c]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0b20ad66656ae918b]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-086dd3b631d809273]
aws_security_group_rule.egress_container: Refreshing state... [id=sgrule-3097792632]
aws_security_group_rule.ingress_container: Refreshing state... [id=sgrule-817931993]
aws_route.internet_route: Refreshing state... [id=r-rtb-02bbf5901ddb3f50e1080289494]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-02866bb7720423fda]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-07cededa4cfa44575]
aws_vpc_endpoint.secrets_manager: Refreshing state... [id=vpce-02c479eb5f4b2fb4d]
aws_security_group_rule.ingress_vpc_endpoint: Refreshing state... [id=sgrule-3888207563]
aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-09bf67ac5b6226a32]
aws_vpc_endpoint.cloudwatch: Refreshing state... [id=vpce-0afa5b8c39584c3c2]
aws_vpc_endpoint.ecr: Refreshing state... [id=vpce-0df60e6d9762489ac]
aws_vpc_endpoint_route_table_association.s3_association[0]: Refreshing state... [id=a-vpce-04766720d62b465613985809231]
aws_alb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:listener/app/app-weather/c2ecf69bbae2469c/97cd0476847139b5]
aws_ssm_parameter.infra_output: Refreshing state... [id=/app-weather/output]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "app-weather-nat-eip-1"
        }
      + tags_all             = {
          + "Name"   = "app-weather-nat-eip-1"
          + "Source" = "https://github.com/kunduso/app-weather"
        }
      + vpc                  = (known after apply)
    }

  # aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "app-weather-nat-eip-2"
        }
      + tags_all             = {
          + "Name"   = "app-weather-nat-eip-2"
          + "Source" = "https://github.com/kunduso/app-weather"
        }
      + vpc                  = (known after apply)
    }

  # aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-0830e0ca62080c581"
      + tags                               = {
          + "Name" = "app-weather-nat-gateway-1"
        }
      + tags_all                           = {
          + "Name"   = "app-weather-nat-gateway-1"
          + "Source" = "https://github.com/kunduso/app-weather"
        }
    }

  # aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-08ee0b91a5f9d6900"
      + tags                               = {
          + "Name" = "app-weather-nat-gateway-2"
        }
      + tags_all                           = {
          + "Name"   = "app-weather-nat-gateway-2"
          + "Source" = "https://github.com/kunduso/app-weather"
        }
    }

  # aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "app-weather-private-rt-1"
        }
      + tags_all         = {
          + "Name"   = "app-weather-private-rt-1"
          + "Source" = "https://github.com/kunduso/app-weather"
        }
      + vpc_id           = "vpc-0a4672ac46effdfa1"
    }

  # aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "app-weather-private-rt-2"
        }
      + tags_all         = {
          + "Name"   = "app-weather-private-rt-2"
          + "Source" = "https://github.com/kunduso/app-weather"
        }
      + vpc_id           = "vpc-0a4672ac46effdfa1"
    }

  # aws_route_table.this_rt_private will be destroyed
  # (because aws_route_table.this_rt_private is not in configuration)
  - resource "aws_route_table" "this_rt_private" {
      - arn              = "arn:aws:ec2:us-east-2:743794601996:route-table/rtb-0628cf5bfda25f054" -> null
      - id               = "rtb-0628cf5bfda25f054" -> null
      - owner_id         = "743794601996" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name" = "app-weather-route-table-private"
        } -> null
      - tags_all         = {
          - "Name"   = "app-weather-route-table-private"
          - "Source" = "https://github.com/kunduso/app-weather"
        } -> null
      - vpc_id           = "vpc-0a4672ac46effdfa1" -> null
    }

  # aws_route_table_association.private[0] will be updated in-place
  ~ resource "aws_route_table_association" "private" {
        id             = "rtbassoc-07cededa4cfa44575"
      ~ route_table_id = "rtb-0628cf5bfda25f054" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_route_table_association.private[1] will be updated in-place
  ~ resource "aws_route_table_association" "private" {
        id             = "rtbassoc-02866bb7720423fda"
      ~ route_table_id = "rtb-0628cf5bfda25f054" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_vpc_endpoint_route_table_association.s3_association[0] must be replaced
  # (moved from aws_vpc_endpoint_route_table_association.s3_association)
-/+ resource "aws_vpc_endpoint_route_table_association" "s3_association" {
      ~ id              = "a-vpce-04766720d62b465613985809231" -> (known after apply)
      ~ route_table_id  = "rtb-0628cf5bfda25f054" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_vpc_endpoint_route_table_association.s3_association[1] will be created
  + resource "aws_vpc_endpoint_route_table_association" "s3_association" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = "vpce-04766720d62b46561"
    }

Plan: 10 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*